---
type: CableTraySizes
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# CableTraySizes

`Autodesk.Revit.DB.Electrical.CableTraySizes` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSize | 2017 | `public void AddSize ( MEPSize sizeInfo )` |
| Method | ClearAll | 2017 | `public void ClearAll ()` |
| Method | Contains | 2017 | `public bool Contains ( double nominalDiameter )` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetCableTraySizes | 2017 | `public static CableTraySizes GetCableTraySizes ( Document aDoc )` |
| Method | GetCableTraySizesIterator | 2017 | `public CableTraySizeIterator GetCableTraySizesIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < MEPSize > GetEnumerator ()` |
| Method | GetSizeCount | 2017 | `public int GetSizeCount ()` |
| Method | RemoveSize | 2017 | `public void RemoveSize ( MEPSize sizeInfo )` |
| Property | Parameter | — | `` |